In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
from sklearn.preprocessing import OneHotEncoder

import datetime
import calendar

In [2]:
loc = "./data/Arrests_2020.csv"
df = pd.read_csv(loc)

In [3]:
valid_cols = ["NHA_NAME", "sex", "age", "date_arr", "time_arr", "fel_misd"]
df = df[valid_cols].dropna()

In [4]:
# Format day, month, sex, fel_misd
date_arr = []
month_arr = []
for i in range(len(df)):
    date = list(df["date_arr"])[i][:10]                           # extract date from df
    calc_date = datetime.datetime.strptime(date, '%Y/%m/%d') 
    
    day = (calc_date.weekday() + 1) % 7
    date_arr.append(day)
    month_arr.append(calc_date.month-1)
        
df.head()

           NHA_NAME sex age                date_arr  time_arr fel_misd
12     Dodge Flower   M  21  2020/01/02 00:00:00+00      2310        M
13     Dodge Flower   M  21  2020/01/02 00:00:00+00      2310        M
15  West University   M  24  2020/01/03 00:00:00+00        16        M
16  West University   M  24  2020/01/03 00:00:00+00        16        M
17     Dodge Flower   M  21  2020/01/02 00:00:00+00      2310        M

In [5]:
df = df.drop("date_arr", axis=1)
df["day"] = date_arr
df["month"] = month_arr

sex_col = df["sex"]
fel_misd_col = df["fel_misd"]

print(f"Range of days: [{min(date_arr)}, {max(date_arr)}]")
print(f"Range of months: [{min(month_arr)},{max(month_arr)}]")
print(f"Range of sex: [{min(sex_col)},{max(sex_col)}]")
print(f"Range of fel_misd: [{min(fel_misd_col)},{max(fel_misd_col)}]")

Range of days: [0, 6]
Range of months: [0,11]
Range of sex: [F,U]
Range of fel_misd: [ ,Â ]

In [6]:
df.head()

           NHA_NAME sex age  time_arr fel_misd  day  month
12     Dodge Flower   M  21      2310        M    4      0
13     Dodge Flower   M  21      2310        M    4      0
15  West University   M  24        16        M    5      0
16  West University   M  24        16        M    5      0
17     Dodge Flower   M  21      2310        M    4      0

In [7]:
# save df
df_1 = df

In [8]:
loc = "./data/Arrests_2021.csv"
df = pd.read_csv(loc)

In [9]:
df = df[valid_cols].dropna()

In [10]:
# Format day, month, sex, fel_misd
date_arr = []
month_arr = []
for i in range(len(df)):
    date = list(df["date_arr"])[i][:10]                           # extract date from df
    calc_date = datetime.datetime.strptime(date, '%Y/%m/%d') 
    
    day = (calc_date.weekday() + 1) % 7
    date_arr.append(day)
    month_arr.append(calc_date.month-1)
        
df.head()

          NHA_NAME sex age                date_arr  time_arr fel_misd
3         Eastside   M  15  2021/01/02 00:00:00+00      1844        M
4         Eastside   M  15  2021/01/02 00:00:00+00      1844        M
5       Rita Ranch   F  25  2021/01/02 20:05:12+00      1741        M
6  Garden District   M  34  2021/01/02 00:00:00+00      2149        F
8  Garden District   M  34  2021/01/02 00:00:00+00      2149        F

In [11]:
df = df.drop("date_arr", axis=1)
df["day"] = date_arr
df["month"] = month_arr

sex_col = df["sex"]
fel_misd_col = df["fel_misd"]

print(f"Range of days: [{min(date_arr)}, {max(date_arr)}]")
print(f"Range of months: [{min(month_arr)},{max(month_arr)}]")
print(f"Range of sex: [{min(sex_col)},{max(sex_col)}]")
print(f"Range of fel_misd: [{min(fel_misd_col)},{max(fel_misd_col)}]")

Range of days: [0, 6]
Range of months: [0,11]
Range of sex: [F,U]
Range of fel_misd: [ ,Â ]

In [12]:
df.head()

          NHA_NAME sex age  time_arr fel_misd  day  month
3         Eastside   M  15      1844        M    6      0
4         Eastside   M  15      1844        M    6      0
5       Rita Ranch   F  25      1741        M    6      0
6  Garden District   M  34      2149        F    6      0
8  Garden District   M  34      2149        F    6      0

In [13]:
df_1.to_csv('./clean_data/Arrests_2020_cleaned.csv', index=False)
df.to_csv('./clean_data/Arrests_2021_cleaned.csv', index=False)